; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p12---int100n150-m25---int100c200---s391---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level2 level2)
(sum level0 level3 level3)
(sum level0 level8 level8)
(sum level0 level12 level12)
(sum level0 level19 level19)
(sum level0 level21 level21)
(sum level0 level24 level24)
(sum level1 level1 level2)
(sum level1 level2 level3)
(sum level1 level3 level4)
(sum level1 level8 level9)
(sum level1 level12 level13)
(sum level1 level19 level20)
(sum level1 level21 level22)
(sum level1 level24 level25)
(sum level2 level1 level3)
(sum level2 level2 level4)
(sum level2 level3 level5)
(sum level2 level8 level10)
(sum level2 level12 level14)
(sum level2 level19 level21)
(sum level2 level21 level23)
(sum level2 level24 level26)
(sum level3 level1 level4)
(sum level3 level2 level5)
(sum level3 level3 level6)
(sum level3 level8 level11)
(sum level3 level12 level15)
(sum level3 level19 level22)
(sum level3 level21 level24)
(sum level3 level24 level27)
(sum level4 level1 level5)
(sum level4 level2 level6)
(sum level4 level3 level7)
(sum level4 level8 level12)
(sum level4 level12 level16)
(sum level4 level19 level23)
(sum level4 level21 level25)
(sum level4 level24 level28)
(sum level5 level1 level6)
(sum level5 level2 level7)
(sum level5 level3 level8)
(sum level5 level8 level13)
(sum level5 level12 level17)
(sum level5 level19 level24)
(sum level5 level21 level26)
(sum level5 level24 level29)
(sum level6 level1 level7)
(sum level6 level2 level8)
(sum level6 level3 level9)
(sum level6 level8 level14)
(sum level6 level12 level18)
(sum level6 level19 level25)
(sum level6 level21 level27)
(sum level6 level24 level30)
(sum level7 level1 level8)
(sum level7 level2 level9)
(sum level7 level3 level10)
(sum level7 level8 level15)
(sum level7 level12 level19)
(sum level7 level19 level26)
(sum level7 level21 level28)
(sum level7 level24 level31)
(sum level8 level1 level9)
(sum level8 level2 level10)
(sum level8 level3 level11)
(sum level8 level8 level16)
(sum level8 level12 level20)
(sum level8 level19 level27)
(sum level8 level21 level29)
(sum level8 level24 level32)
(sum level9 level1 level10)
(sum level9 level2 level11)
(sum level9 level3 level12)
(sum level9 level8 level17)
(sum level9 level12 level21)
(sum level9 level19 level28)
(sum level9 level21 level30)
(sum level9 level24 level33)
(sum level10 level1 level11)
(sum level10 level2 level12)
(sum level10 level3 level13)
(sum level10 level8 level18)
(sum level10 level12 level22)
(sum level10 level19 level29)
(sum level10 level21 level31)
(sum level10 level24 level34)
(sum level11 level1 level12)
(sum level11 level2 level13)
(sum level11 level3 level14)
(sum level11 level8 level19)
(sum level11 level12 level23)
(sum level11 level19 level30)
(sum level11 level21 level32)
(sum level11 level24 level35)
(sum level12 level1 level13)
(sum level12 level2 level14)
(sum level12 level3 level15)
(sum level12 level8 level20)
(sum level12 level12 level24)
(sum level12 level19 level31)
(sum level12 level21 level33)
(sum level12 level24 level36)
(sum level13 level1 level14)
(sum level13 level2 level15)
(sum level13 level3 level16)
(sum level13 level8 level21)
(sum level13 level12 level25)
(sum level13 level19 level32)
(sum level13 level21 level34)
(sum level13 level24 level37)
(sum level14 level1 level15)
(sum level14 level2 level16)
(sum level14 level3 level17)
(sum level14 level8 level22)
(sum level14 level12 level26)
(sum level14 level19 level33)
(sum level14 level21 level35)
(sum level14 level24 level38)
(sum level15 level1 level16)
(sum level15 level2 level17)
(sum level15 level3 level18)
(sum level15 level8 level23)
(sum level15 level12 level27)
(sum level15 level19 level34)
(sum level15 level21 level36)
(sum level15 level24 level39)
(sum level16 level1 level17)
(sum level16 level2 level18)
(sum level16 level3 level19)
(sum level16 level8 level24)
(sum level16 level12 level28)
(sum level16 level19 level35)
(sum level16 level21 level37)
(sum level16 level24 level40)
(sum level17 level1 level18)
(sum level17 level2 level19)
(sum level17 level3 level20)
(sum level17 level8 level25)
(sum level17 level12 level29)
(sum level17 level19 level36)
(sum level17 level21 level38)
(sum level17 level24 level41)
(sum level18 level1 level19)
(sum level18 level2 level20)
(sum level18 level3 level21)
(sum level18 level8 level26)
(sum level18 level12 level30)
(sum level18 level19 level37)
(sum level18 level21 level39)
(sum level18 level24 level42)
(sum level19 level1 level20)
(sum level19 level2 level21)
(sum level19 level3 level22)
(sum level19 level8 level27)
(sum level19 level12 level31)
(sum level19 level19 level38)
(sum level19 level21 level40)
(sum level19 level24 level43)
(sum level20 level1 level21)
(sum level20 level2 level22)
(sum level20 level3 level23)
(sum level20 level8 level28)
(sum level20 level12 level32)
(sum level20 level19 level39)
(sum level20 level21 level41)
(sum level20 level24 level44)
(sum level21 level1 level22)
(sum level21 level2 level23)
(sum level21 level3 level24)
(sum level21 level8 level29)
(sum level21 level12 level33)
(sum level21 level19 level40)
(sum level21 level21 level42)
(sum level21 level24 level45)
(sum level22 level1 level23)
(sum level22 level2 level24)
(sum level22 level3 level25)
(sum level22 level8 level30)
(sum level22 level12 level34)
(sum level22 level19 level41)
(sum level22 level21 level43)
(sum level22 level24 level46)
(sum level23 level1 level24)
(sum level23 level2 level25)
(sum level23 level3 level26)
(sum level23 level8 level31)
(sum level23 level12 level35)
(sum level23 level19 level42)
(sum level23 level21 level44)
(sum level23 level24 level47)
(sum level24 level1 level25)
(sum level24 level2 level26)
(sum level24 level3 level27)
(sum level24 level8 level32)
(sum level24 level12 level36)
(sum level24 level19 level43)
(sum level24 level21 level45)
(sum level24 level24 level48)
(sum level25 level1 level26)
(sum level25 level2 level27)
(sum level25 level3 level28)
(sum level25 level8 level33)
(sum level25 level12 level37)
(sum level25 level19 level44)
(sum level25 level21 level46)
(sum level25 level24 level49)
(sum level26 level1 level27)
(sum level26 level2 level28)
(sum level26 level3 level29)
(sum level26 level8 level34)
(sum level26 level12 level38)
(sum level26 level19 level45)
(sum level26 level21 level47)
(sum level26 level24 level50)
(sum level27 level1 level28)
(sum level27 level2 level29)
(sum level27 level3 level30)
(sum level27 level8 level35)
(sum level27 level12 level39)
(sum level27 level19 level46)
(sum level27 level21 level48)
(sum level27 level24 level51)
(sum level28 level1 level29)
(sum level28 level2 level30)
(sum level28 level3 level31)
(sum level28 level8 level36)
(sum level28 level12 level40)
(sum level28 level19 level47)
(sum level28 level21 level49)
(sum level28 level24 level52)
(sum level29 level1 level30)
(sum level29 level2 level31)
(sum level29 level3 level32)
(sum level29 level8 level37)
(sum level29 level12 level41)
(sum level29 level19 level48)
(sum level29 level21 level50)
(sum level29 level24 level53)
(sum level30 level1 level31)
(sum level30 level2 level32)
(sum level30 level3 level33)
(sum level30 level8 level38)
(sum level30 level12 level42)
(sum level30 level19 level49)
(sum level30 level21 level51)
(sum level30 level24 level54)
(sum level31 level1 level32)
(sum level31 level2 level33)
(sum level31 level3 level34)
(sum level31 level8 level39)
(sum level31 level12 level43)
(sum level31 level19 level50)
(sum level31 level21 level52)
(sum level31 level24 level55)
(sum level32 level1 level33)
(sum level32 level2 level34)
(sum level32 level3 level35)
(sum level32 level8 level40)
(sum level32 level12 level44)
(sum level32 level19 level51)
(sum level32 level21 level53)
(sum level32 level24 level56)
(sum level33 level1 level34)
(sum level33 level2 level35)
(sum level33 level3 level36)
(sum level33 level8 level41)
(sum level33 level12 level45)
(sum level33 level19 level52)
(sum level33 level21 level54)
(sum level33 level24 level57)
(sum level34 level1 level35)
(sum level34 level2 level36)
(sum level34 level3 level37)
(sum level34 level8 level42)
(sum level34 level12 level46)
(sum level34 level19 level53)
(sum level34 level21 level55)
(sum level34 level24 level58)
(sum level35 level1 level36)
(sum level35 level2 level37)
(sum level35 level3 level38)
(sum level35 level8 level43)
(sum level35 level12 level47)
(sum level35 level19 level54)
(sum level35 level21 level56)
(sum level35 level24 level59)
(sum level36 level1 level37)
(sum level36 level2 level38)
(sum level36 level3 level39)
(sum level36 level8 level44)
(sum level36 level12 level48)
(sum level36 level19 level55)
(sum level36 level21 level57)
(sum level36 level24 level60)
(sum level37 level1 level38)
(sum level37 level2 level39)
(sum level37 level3 level40)
(sum level37 level8 level45)
(sum level37 level12 level49)
(sum level37 level19 level56)
(sum level37 level21 level58)
(sum level37 level24 level61)
(sum level38 level1 level39)
(sum level38 level2 level40)
(sum level38 level3 level41)
(sum level38 level8 level46)
(sum level38 level12 level50)
(sum level38 level19 level57)
(sum level38 level21 level59)
(sum level38 level24 level62)
(sum level39 level1 level40)
(sum level39 level2 level41)
(sum level39 level3 level42)
(sum level39 level8 level47)
(sum level39 level12 level51)
(sum level39 level19 level58)
(sum level39 level21 level60)
(sum level39 level24 level63)
(sum level40 level1 level41)
(sum level40 level2 level42)
(sum level40 level3 level43)
(sum level40 level8 level48)
(sum level40 level12 level52)
(sum level40 level19 level59)
(sum level40 level21 level61)
(sum level40 level24 level64)
(sum level41 level1 level42)
(sum level41 level2 level43)
(sum level41 level3 level44)
(sum level41 level8 level49)
(sum level41 level12 level53)
(sum level41 level19 level60)
(sum level41 level21 level62)
(sum level41 level24 level65)
(sum level42 level1 level43)
(sum level42 level2 level44)
(sum level42 level3 level45)
(sum level42 level8 level50)
(sum level42 level12 level54)
(sum level42 level19 level61)
(sum level42 level21 level63)
(sum level42 level24 level66)
(sum level43 level1 level44)
(sum level43 level2 level45)
(sum level43 level3 level46)
(sum level43 level8 level51)
(sum level43 level12 level55)
(sum level43 level19 level62)
(sum level43 level21 level64)
(sum level43 level24 level67)
(sum level44 level1 level45)
(sum level44 level2 level46)
(sum level44 level3 level47)
(sum level44 level8 level52)
(sum level44 level12 level56)
(sum level44 level19 level63)
(sum level44 level21 level65)
(sum level44 level24 level68)
(sum level45 level1 level46)
(sum level45 level2 level47)
(sum level45 level3 level48)
(sum level45 level8 level53)
(sum level45 level12 level57)
(sum level45 level19 level64)
(sum level45 level21 level66)
(sum level45 level24 level69)
(sum level46 level1 level47)
(sum level46 level2 level48)
(sum level46 level3 level49)
(sum level46 level8 level54)
(sum level46 level12 level58)
(sum level46 level19 level65)
(sum level46 level21 level67)
(sum level46 level24 level70)
(sum level47 level1 level48)
(sum level47 level2 level49)
(sum level47 level3 level50)
(sum level47 level8 level55)
(sum level47 level12 level59)
(sum level47 level19 level66)
(sum level47 level21 level68)
(sum level48 level1 level49)
(sum level48 level2 level50)
(sum level48 level3 level51)
(sum level48 level8 level56)
(sum level48 level12 level60)
(sum level48 level19 level67)
(sum level48 level21 level69)
(sum level49 level1 level50)
(sum level49 level2 level51)
(sum level49 level3 level52)
(sum level49 level8 level57)
(sum level49 level12 level61)
(sum level49 level19 level68)
(sum level49 level21 level70)
(sum level50 level1 level51)
(sum level50 level2 level52)
(sum level50 level3 level53)
(sum level50 level8 level58)
(sum level50 level12 level62)
(sum level50 level19 level69)
(sum level51 level1 level52)
(sum level51 level2 level53)
(sum level51 level3 level54)
(sum level51 level8 level59)
(sum level51 level12 level63)
(sum level51 level19 level70)
(sum level52 level1 level53)
(sum level52 level2 level54)
(sum level52 level3 level55)
(sum level52 level8 level60)
(sum level52 level12 level64)
(sum level53 level1 level54)
(sum level53 level2 level55)
(sum level53 level3 level56)
(sum level53 level8 level61)
(sum level53 level12 level65)
(sum level54 level1 level55)
(sum level54 level2 level56)
(sum level54 level3 level57)
(sum level54 level8 level62)
(sum level54 level12 level66)
(sum level55 level1 level56)
(sum level55 level2 level57)
(sum level55 level3 level58)
(sum level55 level8 level63)
(sum level55 level12 level67)
(sum level56 level1 level57)
(sum level56 level2 level58)
(sum level56 level3 level59)
(sum level56 level8 level64)
(sum level56 level12 level68)
(sum level57 level1 level58)
(sum level57 level2 level59)
(sum level57 level3 level60)
(sum level57 level8 level65)
(sum level57 level12 level69)
(sum level58 level1 level59)
(sum level58 level2 level60)
(sum level58 level3 level61)
(sum level58 level8 level66)
(sum level58 level12 level70)
(sum level59 level1 level60)
(sum level59 level2 level61)
(sum level59 level3 level62)
(sum level59 level8 level67)
(sum level60 level1 level61)
(sum level60 level2 level62)
(sum level60 level3 level63)
(sum level60 level8 level68)
(sum level61 level1 level62)
(sum level61 level2 level63)
(sum level61 level3 level64)
(sum level61 level8 level69)
(sum level62 level1 level63)
(sum level62 level2 level64)
(sum level62 level3 level65)
(sum level62 level8 level70)
(sum level63 level1 level64)
(sum level63 level2 level65)
(sum level63 level3 level66)
(sum level64 level1 level65)
(sum level64 level2 level66)
(sum level64 level3 level67)
(sum level65 level1 level66)
(sum level65 level2 level67)
(sum level65 level3 level68)
(sum level66 level1 level67)
(sum level66 level2 level68)
(sum level66 level3 level69)
(sum level67 level1 level68)
(sum level67 level2 level69)
(sum level67 level3 level70)
(sum level68 level1 level69)
(sum level68 level2 level70)
(sum level69 level1 level70)

(connected l0 l1)
(fuelcost level3 l0 l1)
(connected l0 l3)
(fuelcost level24 l0 l3)
(connected l0 l5)
(fuelcost level21 l0 l5)
(connected l1 l0)
(fuelcost level3 l1 l0)
(connected l1 l3)
(fuelcost level8 l1 l3)
(connected l1 l4)
(fuelcost level12 l1 l4)
(connected l1 l5)
(fuelcost level3 l1 l5)
(connected l2 l3)
(fuelcost level19 l2 l3)
(connected l2 l4)
(fuelcost level1 l2 l4)
(connected l3 l0)
(fuelcost level24 l3 l0)
(connected l3 l1)
(fuelcost level8 l3 l1)
(connected l3 l2)
(fuelcost level19 l3 l2)
(connected l4 l1)
(fuelcost level12 l4 l1)
(connected l4 l2)
(fuelcost level1 l4 l2)
(connected l4 l5)
(fuelcost level2 l4 l5)
(connected l5 l0)
(fuelcost level21 l5 l0)
(connected l5 l1)
(fuelcost level3 l5 l1)
(connected l5 l4)
(fuelcost level2 l5 l4)

(at t0 l4)
(fuel t0 level70)
(= (total-cost) 0)

(at p0 l0)
(at p1 l4)
(at p2 l3)
(at p3 l2)
(at p4 l1)
(at p5 l3)
(at p6 l2)
(at p7 l1)
(at p8 l1)
(at p9 l3)
(at p10 l1)
(at p11 l3)
)

(:goal
(and
(at p0 l2)
(at p1 l0)
(at p2 l2)
(at p3 l1)
(at p4 l0)
(at p5 l0)
(at p6 l4)
(at p7 l4)
(at p8 l0)
(at p9 l5)
(at p10 l3)
(at p11 l4)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l4 l1 level58 level12 level70)
   deleted: (at t0 l4) (fuel t0 level70)
   added: (at t0 l1) (fuel t0 level58)
   goals met: 0 of 12
2. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 0 of 12
3. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 12
4. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 0 of 12
5. (drive t0 l1 l0 level55 level3 level58)
   deleted: (at t0 l1) (fuel t0 level58)
   added: (at t0 l0) (fuel t0 level55)
   goals met: 0 of 12
6. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 12
7. (drive t0 l0 l3 level31 level24 level55)
   deleted: (at t0 l0) (fuel t0 level55)
   added: (at t0 l3) (fuel t0 level31)
   goals met: 0 of 12
8. (unload p10 t0 l3)
   deleted: (in p10 t0)
   added: (at p10 l3)
   goals met: 1 of 12
9. (load p9 t0 l3)
   deleted: (at p9 l3)
   added: (in p9 t0)
   goals met: 1 of 12
10. (load p5 t0 l3)
   deleted: (at p5 l3)
   added: (in p5 t0)
   goals met: 1 of 12
11. (load p2 t0 l3)
   deleted: (at p2 l3)
   added: (in p2 t0)
   goals met: 1 of 12
12. (load p11 t0 l3)
   deleted: (at p11 l3)
   added: (in p11 t0)
   goals met: 1 of 12
13. (drive t0 l3 l2 level12 level19 level31)
   deleted: (at t0 l3) (fuel t0 level31)
   added: (at t0 l2) (fuel t0 level12)
   goals met: 1 of 12
14. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 2 of 12
15. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 3 of 12
16. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 3 of 12
17. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 3 of 12
18. (drive t0 l2 l4 level11 level1 level12)
   deleted: (at t0 l2) (fuel t0 level12)
   added: (at t0 l4) (fuel t0 level11)
   goals met: 3 of 12
19. (load p1 t0 l4)
   deleted: (at p1 l4)
   added: (in p1 t0)
   goals met: 3 of 12
20. (unload p11 t0 l4)
   deleted: (in p11 t0)
   added: (at p11 l4)
   goals met: 4 of 12
21. (unload p6 t0 l4)
   deleted: (in p6 t0)
   added: (at p6 l4)
   goals met: 5 of 12
22. (unload p7 t0 l4)
   deleted: (in p7 t0)
   added: (at p7 l4)
   goals met: 6 of 12
23. (drive t0 l4 l5 level9 level2 level11)
   deleted: (at t0 l4) (fuel t0 level11)
   added: (at t0 l5) (fuel t0 level9)
   goals met: 6 of 12
24. (unload p9 t0 l5)
   deleted: (in p9 t0)
   added: (at p9 l5)
   goals met: 7 of 12
25. (drive t0 l5 l1 level6 level3 level9)
   deleted: (at t0 l5) (fuel t0 level9)
   added: (at t0 l1) (fuel t0 level6)
   goals met: 7 of 12
26. (load p8 t0 l1)
   deleted: (at p8 l1)
   added: (in p8 t0)
   goals met: 7 of 12
27. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 8 of 12
28. (drive t0 l1 l0 level3 level3 level6)
   deleted: (at t0 l1) (fuel t0 level6)
   added: (at t0 l0) (fuel t0 level3)
   goals met: 8 of 12
29. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 9 of 12
30. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 10 of 12
31. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 11 of 12
32. (unload p8 t0 l0)
   deleted: (in p8 t0)
   added: (at p8 l0)
   goals met: 12 of 12
